sdaiCreateEmptyADB
\details
Creates an empty attribute data block (ADB) instance.
\returns An identifier of the created ADB if it was successfully created; otherwise, the function returns the NULL value.